In [ ]:
import pandas as pd

# DataFrame original con índice 'SKU'
data = pd.DataFrame({
    'SKU': [31390, 31871, 31874],
    'Producto': ['a', 'a', 'a'],
    'Categoria': ['a', 'a', 'a'],
    'Tienda': [0, 0, 0],
    'Bodega': [0, 0, 0],
    'Total': [0, 0, 0],
    'Unidad': ['a', 'a', 'a']
}).set_index('SKU')


#data2 = pd.DataFrame({
#    'SKU': [31390, 31871, 31874],
#    'BANDEJA': [1, 2, 6],
#    'Tienda': [1, 1, 1],
#    'Bodega': [2, 2, 2],
#    'MOVER': [3, 3, 3]
#}).set_index('SKU')



# Leer Excel sin encabezado y asignar la fila 4 como encabezado
pp = pd.read_excel("ppt.xlsx", header=None)
pp.columns = pp.iloc[4]   # fila 4 (índice 4) como nombres de columnas
pp = pp[5:].reset_index(drop=True)  # tomar desde fila 5 hacia abajo, resetear índice
pp = pp.loc[:, ~pp.columns.isna()]   # eliminar columnas con nombre NaN

pp.columns = ['Producto', 'Categoria', 'SKU', 'Tienda', 'Bodega', 'Total', 'Unidad']
pp['columna'] = pp['Tienda'].astype(int)
pp['columna'] = pp['Bodega'].astype(int)

# Asignar índice SKU para poder hacer update basado en índices
NuevoID = pp.set_index('SKU')

# Actualizar el DataFrame 'data' con los valores del DataFrame 'NuevoID'
data.update(NuevoID)

In [110]:
NuevoID.head()

,Producto,Categoria,Tienda,Bodega,Total,Unidad
SKU,,,,,,
31390,Hamburguesa Cheddar Bacon Fresco,Grab And Go,1,0,1,unidad
31391,Hamburguesa Classic Cheddar Fresco,Grab And Go,0,0,0,unidad
31871,Miga Ave Pimenton Fresco,Grab And Go,14,0,14,unidad
31872,Miga Ave Mayo Fresco,Grab And Go,5,0,5,unidad
31873,Miga Ave Palta Fresco,Grab And Go,0,0,0,unidad

In [111]:
data.head()

      Producto Categoria  Tienda  Bodega  Total Unidad
SKU
31390        a         a       0       0      0      a
31871        a         a       0       0      0      a
31874        a         a       0       0      0      a

In [113]:
pp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 472 entries, 0 to 471
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Producto   472 non-null    object
 1   Categoria  471 non-null    object
 2   SKU        471 non-null    object
 3   Tienda     471 non-null    object
 4   Bodega     443 non-null    object
 5   Total      472 non-null    object
 6   Unidad     471 non-null    object
dtypes: object(7)
memory usage: 25.9+ KB